package student_artur_zaharov.lesson_2.level_4_junior;

public class ZA_Task_12 {

    public static void main(String[] args) {

        System.out.println("Для компиляции Java-кода с помощью JDK компилятора javac из командной строки (консоли), выполните следующие шаги:\n" +
                "\n" +
                "Откройте командную строку (Command Prompt) или терминал:\n" +
                "\n" +
                "Windows: Можно использовать командную строку, запустив \"Command Prompt\" из меню \"Пуск\" или \"Run\" (Win + R) и введя \"cmd\".\n" +
                "\n" +
                "Linux/MacOS: Откройте терминал.\n" +
                "\n" +
                "Перейдите в каталог, содержащий ваш Java-код:\n" +
                "\n" +
                "Используйте команду cd для изменения текущего рабочего каталога. Например:\n" +
                "\n" +
                "bash\n" +
                "Copy code\n" +
                "cd путь_к_вашему_коду\n" +
                "Скомпилируйте Java-код с помощью javac:\n" +
                "\n" +
                "Введите следующую команду для компиляции Java-файла (например, YourFileName.java):\n" +
                "\n" +
                "bash\n" +
                "Copy code\n" +
                "javac YourFileName.java\n" +
                "Если компиляция прошла успешно, в текущем каталоге появится файл с расширением .class. Этот файл содержит байт-код, готовый к выполнению на виртуальной машине Java (JVM).\n" +
                "\n" +
                "Запустите скомпилированный класс:\n" +
                "\n" +
                "После успешной компиляции, вы можете выполнить Java-приложение с помощью команды java. Например:\n" +
                "\n" +
                "bash\n" +
                "Copy code\n" +
                "java YourFileName\n" +
                "Где YourFileName - имя вашего класса (без расширения .class).\n" +
                "\n" +
                "Таким образом, вы можете использовать компилятор javac и виртуальную машину Java (java) непосредственно из командной строки для компиляции и выполнения Java-приложений без использования среды разработки.");
    }
}
