package student_dmitrijs_voronins.lesson_2.level__2;

public class Task_7 {
    public static void main(String[] args) {
        System.out.println("You can login!");
    }
}
//Дан код, нужно сделать этот код запускаемым.
//Для сдачи работы создайте исправленный класс.
//
//class LoginService {
//
//	public void main(String[] args) {
//		System.out.println("You can login!");
//	}
//
//
//}
//Task_7